#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "59109529b862405026ab30a212337945" -> "b507ea74db9f6b1a00649fc9ef03d845"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "786afdfc5e23db22c60e3cdce976bd29" -> "7b1d08d526fee5dbb9b7aea2f2ffb21a"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "bc6d00cd2d6ef20e5d0f044bec43317b" -> "d4fd00a794613e7961acf76dd0f3fdcc"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "d8a7065af7797eeccc8e1f6474a2cda9" -> "a8a5d71b501985dc5b425c10b14420f4"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "ce8e66d7929d3bed051db73d1336882a" -> "2303b35c9f9bb6694eb22d92737aac64"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "8d1f4fb13d8b69d716945640695aae4c" -> "7ccd464d83f987febd25c3fb8d406208"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "640ef1d30cc8c676602d77ad43a2df24" -> "117a063c1442f60a8b81f1e4da1da06b"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "7243ba16cfeda405a39b5a157122a431" -> "d8a9c15c10c68860ecd7c42649d0971b"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "183ed4596bce81a9d1b0706ec05b2707" -> "0ae1719fe069c64df4df1928ef686d72"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "0f4705f5c47bb28ecd25d1d5911e7fbf" -> "2bc360c6062443eedc3ce3d198fe8832"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "24447e3c0ef8c03862445f4903e53c97" -> "322dbf0b5f3b3631bafab3e1dbffdfd7"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "d20b0be2832af54fb8c780b5df0ec8d0" -> "17c0fd8dc2ee47b15bb36562cd479c29"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "42943f032cda67ff70ec103f7eff6822" -> "7035e01724c6a83360c63ca0c3edc556"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "9eb0bc7abb1305fcce24c794c0d93106" -> "c48a20724deb480a536308bf72ca6c3a"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "ebb647ba701ae70603275d7d3705e3b3" -> "fbb97c6fa4f7120bd6df530a99f4df3b"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "fd670b88e6d400d4e5106e22bdf9b681" -> "c11b2584094bc513fad68ae549daba22"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "0386cc15e103c255d1e497db5e5d470e" -> "3a3579d485bfcb74b1a337b79e0d5329"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "be4cd198f204f6dfdc7f79103a6550fb" -> "7b46b909e23bde12937df626ee361a5a"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "df53a95efdc4752a3d259d7ad2ce2f52" -> "01497daaae3f245e354c92039d541e28"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "8bbc7213914231237e3cb8a6ddb0c637" -> "2afd2561c52b5a2100b06ac94ec32e39"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "7f477898286c1c9d99e04018c9734635" -> "5aa13a02992e637fe019577d0c22c1a2"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "b3eb58e90b2bc5d259d9500d75581d0e" -> "a0d5aee011e14dadc95f78b0918a2515"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "9172ed92b557543afb85d7b494e66389" -> "215404308c5d81eebad05d0aa1c3b2d4"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "f82782064b776f5002981133805ed64c" -> "534ac193f22139d9542478b0e1622d0f"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "9788ff6d2a0acf4ab10ee94fde39b897" -> "b60057f58221f4d103738dce92b4f612"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "03e1e9a10ea957801e7018fc347b0928" -> "2fb8995699a9809e486feaa6fff7aa62"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "153794310a7533ac14603649f0efcf56" -> "0b35d486c56465fbf654e22bae87353b"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "bffb163b6cadf2caef714c42f78b2771" -> "3c2759c03a1052c027e1f14547272b3d"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "fdd82b856b9ab1a7dc04a61c939503fa" -> "9fd09542f2d968a1180b65f2d69e910c"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "0c81b05a67d63b7e74331bfc7e39e4ba" -> "f06d5880447b917b8dd3f68479cd8986"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "b653cf6c8be483286da4a68dff4406c1" -> "b40d546fa05dc8242eb67188304b4955"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "0c3845ef2cf149f4ddaadde56818c310" -> "c708bdc8d1846d92eaecdd47d558425b"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "4dab210569d0cdea4c341bf5d468b6f2" -> "8f0bdc316351a4addc705158dbbcd9de"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "1c76021e4b9f2acc5357abab82e0896e" -> "d27838c7a3904920f77ac4e5365eb028"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "4fd3d4974ddcee3a3299873520e1b1a5" -> "b760c8eab14234fdc7d2b72f574e8dd5"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "bc272945b588d69a731b9f0f1fac5a06" -> "22f435a65b518d67e8d60c72e437d9d2"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "e9721a7ae621d772e52c529a73dbaeef" -> "f76ee3894810b0c87d67049588f29266"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "826cc90e0e174f700a8631ffddcb7bb3" -> "49d8cb296842900d8a91e387f2ceb731"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "67bd988e9bd93d734e50df14a6613566" -> "c18efcf6409a74b786d61556a40d7f30"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "a90fe34b6a1a7937e76e2c73a454cee4" -> "4c7b6c3b5db0966f55a4dcffe4c8cb7b"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "de7a6f2d947b9e405f8ae44ffe88f70f" -> "784ffe2f07faa641797492938de415df"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "02185a01236ba10490afa6e8c3d33e24" -> "366c74001a6d1488b333154cfdf03e3a"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "cf91d98537a20fceedc6e8ca0964fba4" -> "9dcb3da26bf4497c1af2f8dd9ecca8f9"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "3cfddd7419887b8dc1aa3fbd79cc2e7e" -> "b2bb4957328fce6da530db0e9d454449"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "688a2fcce0ca4ddea38fb64913fdcf69" -> "d8379e2e881e19d89e69a36fb9ea4452"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "5a7785e5ce20354666bd0b1bdef918fe" -> "0e4b5e3b6f35cd1e1c502d03843e1f72"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "7b23273347bc213cb703c5a7ee5f4a43" -> "0407879b74bafc999656c2b3b34905c8"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "sCoikEC30zvJMt1/fCPQb2iFxpmSFBPEBDnZlxTwXSo=" -> "8uTElVsfiInZPzLZcbTpq5uavrveslszqQtP8IsVrAw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "JiD2k6IcPCKtaouMcFIxa5W7itysuz5oU7p6YSxxJzM=" -> "GsjShH1OqrTOqW8FyDsC0nqCQYfdIhitZjra4rVvFtc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "aCuH9F3lFVh7q7bG48HfVjAWJwDVKJ6sfHZwr1Tdd74=" -> "ru/DFPWzVvEpvvYDc8J5Zx7K2Hpfb9rUkRT9NN6PHCo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "38p1DgXoHWHdvNYCaWxi73oWcA/HuyOVkIT5oEAUA48=" -> "G6jV9R8pww9s2OoE2dI2pUc0YcaRKUCFesJb1T+WoEo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "qvkQC5ijMEO53xTeMPnDmHdxom2r8LpxJOWiHteT4Yo=" -> "rJ71MTRD/s13Um7Smr5bTUpyJj07wm0JgzJa3GvCt5c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "GWZFICI16Mmnitls4oICL9gJGxRmHUbtdIA2WMb+yt8=" -> "ANAPePgXM89g9jCsG7Y6EwLKRn2iFXAVaTZey1w0aj0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "NWjIrj+RRvnfUL1FDgQca3zatoqvyji7stfgatWySj0=" -> "zNmbaqAeXb3PisUHbXBjpb36bTF2jFSPecm1eKYc05g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "c8+fyGXo6On9CVDsENNC3DzLE3hqtVuAuwwIsaEaa6c=" -> "i+UhZo5kt/RgVsrxJStyLb1EigYYc6Bzt3039wjnJdQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "yKvHYEcpKRSyX7rnGyF6B7IGKoh+vdltaGY3rpcqdKo=" -> "4BPsHfahPjwX+qyvLcn6BtwvOVe9O2NreOxJsrG4ORw="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "qojgTDYT6Ub0KKt7905ehhRw0KkOarA8RoWyHnBd+vA=" -> "U3/7Dip3NMsCv8/ZuFvyuSgmk9xLzeknNjw7d/DZzdc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "yZ2dZzrcamyTXC7o9acgxyKCTewbdB56Mdd2+BwyQ/8=" -> "sc437UqH+ANNFgjxK5z0nidFIlqZ3I/EkzmpmqXT9OM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "6GiMO4XimdCmYkQt8vfTM4REHKSLRKCQGTU9OQqTjn0=" -> "TPe3lJhqP7iSSdpc73K7H8MjidiuRq7Gnw73Ei0zczY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "yZ3TypB3WSmN22FAI2IZqF7nTNfSEAmDtEti/alRq+I=" -> "5NXZZCTl3S5877erPa1+YWxrfNRRh7Lth2gBs9txk28="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "p7tKz+J81GNbBZ5DFM816T6q3O6k4PdeYnNKLYTNojs=" -> "YYmIjfeK5bm9RrlYRx/6nscDhBhzi7/iKrrlG+rUKFM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "/xyE9vXplVnn/dG+DDp4h7H2h2m6ERMh7g0fI17N2Hc=" -> "eZmwOSHXypV72vgA/xrKE2jG8Ed6AtgxYMUsirCi1UM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "xa/302K44/xgMEo/c7iW79y+8xTh+jf6cjxrzCVXohc=" -> "GS7Y6kOioKeuPDdWk9IrCZk5mLONOmlpbjJDVTPZUFo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "xp4m5RykDHlvFYKP774h1NMLN1WdUcTXaWZPopu2B/Q=" -> "lq4YEblLrxVAuTamcuB9qTooUHmKDJPwTMb8Ww65GHo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "FofZCyh15v+D3Ezz1gbtARiSATUmk0fluwfzsw9BoX0=" -> "N6MtA2lviLpICmusqdXZgUFm/ZAWeJSooUt7tbUAMaM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "UUcCiNdh6txDzYU/A5vM9tmVCd5WAPOBOjxGDBaEvHc=" -> "i6JCnC9SbKdYOWI7+l2Kj/ZTXOf716znOQA/YHaOnVY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:34:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "2KOgushnSteholebq0lNY95fEqJvutNKhwLiScwreRw=" -> "myyoOUpzuAeKQ0gqGcAvOmJfGKq2pZ+S3L+6MPl2fp0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "C7K82XGHsQachb5phRs+jwGr/BriEG8/M6c2zFYg1Io=" -> "HrOHUq7ZhdXh60OaEPvqzPxO5GhXRrSPQHxoGJQzv+U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "RuBPGp+2SuMbTRSVt9Smj1gmVjKyZDLn3cQeMH1vY+c=" -> "oP/tvSpNW1LuOeHZMV3DmXJ+7zlIb6Esc9lRzTxY/SQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "GEe0ku9n4Osbe6BbfAoT5fpe/3SzzxKBcGWDeu6iyko=" -> "nBmmfta99R8WrqUWilofXFMtZukl/rNorQgwmvMVW54="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "SH01WAsAaKusxQXaoOG6TikVVzCHCijE4C+xfcAHpWU=" -> "7Kxyw8F43QBD5Lz05e/0kQg4iQ9HJJrrkdRqA0BCkUA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "BbbEesoy20k7RNHw/kC4rpml+rCef/bpY+nsqdUcR4w=" -> "2i4CdCbkYcvgwPW8G6ASozyJfwdEzLqqC5c82mbDhCg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:50:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "7lec+69anKp+qySn71v4lYZExCLquN/6gek4R0VPEO4=" -> "GwhxJM4NfDSNHRphLzUGyz2MbFtgFZPFDQJRE+MCsm0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ca7VqEBRd1sG8L+24gex6ElrC1rZneDTCuguZG+H2hY=" -> "hhQVAoJM5YTya1yyQhrTxp5TucAfyo36Ho2fN83lFnY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "JWHxTlg5Q+Z+R2LZrT3qqWgXn0+WfWbYe6Zlwsvvrlw=" -> "dj/V3gFJ1lGJmSqFb1sp/5plCzvBRLpCGgnHUHG+ivs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:40:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "FzOz6jOnS4O7JoKkeXcAvZorfBUo1oJbyYvkIDZy6Gw=" -> "61OoRPMUkl6ETvC0kyabuGgtBl8HHD6rcx7Qic48uTk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "s1jtTsgLy8BLv6GdDOREYLMASbYG5U9WKaoYKl8ECkE=" -> "oZWl3uF5nbPJw2ldSF1omdhj8fgJpPDmr3G/dRz6p0s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-24T15:06:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "qpI3Vz64P8/c37UTxDqgNO077hdAroDakRaXOdPp9o0=" -> "zzHzI6FhPWSIQAf6g1kT1Vz9rGVUhZlielRcSuGRdGA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "YckJBSVlrHUF9UtqxJRUYxsLU7rvpsNsy9Wiy/RiXtA=" -> "Zd/ygw1eyvXzM621XQfppgS1rCdM9GOO5lwdEJ3og3Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "alVJxTV2UeyfGMInaIxRmlO7TF7dO1UcOsT+TKCeMhc=" -> "yY2HaNGFerofaHWpAUQLuVXjwoZblfU8tpYFIaAuOEI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "kpGmehOTAedxtpxhdFrfmTMUNGNKV2Lp/rkYdv0R+nI=" -> "kFqN+acM2UjUqAi5IDk2yRRCcvZEB+4M0F9nwg9BdaA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "pOkK10OtJWgsmxfz9CyYLuYJjxahZGDWBZYIh5cnjZA=" -> "AKRiZ1KHIILrunqeCe2raEZIwPbKdRiyBFm4BYeZ76s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "BryM2VMY//KXPI3EEH2wI2gLXF4tH0r6o+EyM9Der8s=" -> "PZHR1JeTqJYWqqrV+RVQrHK9u91I9aMtfdWc/BTLfqU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "PbcWe7E7x1wr9o/AJsWFMaTtAOTHyNulY3qJrpWAut0=" -> "CRGj0/nx7PIzgy6opgylAuZia7kG9umdn7H2tSGes6Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "vVA+iG7OQml6x7DcX1LmzbdC65UGazOKOUa1EIrm96s=" -> "8mbJJjwbbCzVbzpdJwUkb3jL57y1vyZRtqGeSj+WDJQ="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "CUGIJeH8habHelQZRnOsdcguCCd9gDJwqrw54ECUmr4=" -> "Xixm3tY4it3aE2FdHjCWb/LlBlhLNQL82AJhi/7hJqM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "iJGpKfKBl+g8pnQwU/Kk9Q1w4wVjK/ngzIcqQQS2bXw=" -> "2B7A3Vr3lc0xVF29JCeh1kjDDz+l55DeV8amuDpVGUU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "t1seLdabUX3/GrwSkeDP8iEQhKwxT9ZqSnAvuiVHQCE=" -> "5LITxKX0Z27gybIFT5I55acl1vIqoJEPX9nyU820C+c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "bZPb0rkNMduUtZTNn/LVoocUtJddONklR07wYXGiSmA=" -> "9CYUiErCcAHkXvF0V0nzxClE9rKvGs02f1IJBMpBYvc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "O2s+HdSlOcREm2D4nc3bProI1iDwON1DVe08x0BR2Ow=" -> "A4m98kvQWxZe5Ga6CHwUgddhMVrQiVvI6FGMn4hxdFo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "vKAgt2/WRVYqi+8/QYFrI1lMaLjJqGhw+kxNapAYJV4=" -> "T4ZebNHuCeDMWCIxjLRsO4CP9luZBuyYf6z0Qb9m3kY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "ehKYQXHsw3KWgfz6nWFXs/NeTJlz3xbCnPg+n61pNmg=" -> "at8YOdcT86ao7wazieSED2t2a/iMDD92SCdXYtRqEDo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "64Xsh0e/Kv90AgznN7CuKYLYv8KNYLpk+2CFGHm/A74=" -> "3pF2ErVo6ET48qwQgFvBt7W4mEhIO3C8WLdNmU7l83M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-17T14:53:29Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "7xufwb" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-17T14:53:28Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-17T14:53:28Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*